<a href="https://colab.research.google.com/github/edydev85/technical-discussion/blob/main/Pandas_shift.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas shift()

# https://scrapbox.io/ds-cookbook/pandas_shif()

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame({
    "A": [1,2,3,4,5],
    "B": [10,20,30,40,50]
})

In [ ]:
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [ ]:
# agora vamos "empurrar" os valores para baixo
# repare q o indice é mantido e os valores irão descer uma linha
# lembre que em python o indice começa com 0, o q causa aquele estranhamento ind = 0, val = 1 ... ind=4, val = 5
df.shift(1)

     A     B
0  NaN   NaN
1  1.0  10.0
2  2.0  20.0
3  3.0  30.0
4  4.0  40.0

In [ ]:
# por se tratar de variaveis numericas, se eu quisesse trocar o NaN do preenchimento, por 0s, então:
df.shift(1, fill_value=0)

   A   B
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40

In [ ]:
# se queremos "empurrar" os dados na direção inversa (ou seja, de baixo para cima, ao inves de ser de cima para baixo)
# usamos um 'periods' negativo
df.shift(-1)

     A     B
0  2.0  20.0
1  3.0  30.0
2  4.0  40.0
3  5.0  50.0
4  NaN   NaN

# Deslocando time-series com 'freq'
Se o index do DataFrame for uma var data ou datetime, então podemos usar o argumento 'freq' para fazer deslocamentos nos dados com series temporais

In [ ]:
# trocando o index por um range de datas
date_index = pd.date_range("2020-01-01", freq='D', periods=5) 
df.set_index(date_index, inplace=True) # inplace tem q ser true, senão cria outro objeto

            A   B
2020-01-01  1  10
2020-01-02  2  20
2020-01-03  3  30
2020-01-04  4  40
2020-01-05  5  50

In [ ]:
# agora vamos fazer um shift de 10 dias 
df.shift(periods=10, freq='D')

            A   B
2020-01-11  1  10
2020-01-12  2  20
2020-01-13  3  30
2020-01-14  4  40
2020-01-15  5  50

In [ ]:
#continua
https://towardsdatascience.com/all-the-pandas-shift-you-should-know-for-data-analysis-791c1692b5e

In [ ]:
!pip freeze > requirements.txt